package src.LR.LR5_8;

// Юрцук Константин Сергеевич
// Лабораторная работа №5
// Вариант: 26

/*НАСЛЕДОВАНИЕ И ПОЛИМОРФИЗМ

Реализовать предметную область:
1 Записная книжка. Создать родительский класс «Событие» (дата, время) и дочерние классы:
- «День рождения» (именинник, место проведения праздника и возраст);
- «Встреча» (человек с которым назначена встреча и место встречи);
- «Другое» (описание).
Реализовать класс для хранения списка событий с методом добавления события и методом печати списка событий.

*/

public class LR5 {

    // Основной метод класса
    public static void main(String[] args) {

    }
}