package src.LR.LR5;
// Юрцук Константин Сергеевич
// Лабораторная работа №1
// Вариант: 26

/*1.10. Вычисление функции разложением её в ряд

Составить программу нахождения суммы ряда с заданной точностью
eps. Использовать рекуррентные соотношения при вычислении очередного
элемента ряда. Предусмотреть вычисление по контрольной формуле.
Суммы рассматриваемых рядов конечны для значений x, абсолютная
величина которых меньше единицы, причем сумма начальных элементов
ряда отличается от суммы бесконечного ряда на величину, которая не пре-
восходит абсолютной величины eps. Абсолютная величина суммы всех
отброшенных членов ряда меньше eps.*/

public class LR5 {
    public static void main(String[] args) {
        
    }
}

